#ifndef __NEWOPTIONSDIALOG_H__
#define __NEWOPTIONSDIALOG_H__

#include "SexyAppFramework/widget/Dialog.h"
#include "SexyAppFramework/widget/SliderListener.h"

class LawnApp;
class LawnStoneButton;
class NewLawnButton;
namespace Sexy
{
	class Slider;
};

class NewOptionsDialog : public Sexy::Dialog, public Sexy::SliderListener
{
protected:
	enum
	{
		NewOptionsDialog_MusicVolume,
		NewOptionsDialog_SoundVolume,
		NewOptionsDialog_Almanac,
		NewOptionsDialog_MainMenu,
		NewOptionsDialog_Restart,
		NewOptionsDialog_Update,
		NewOptionsDialog_CheatCode,
	};

public:
	LawnApp*			    mApp;								//+0x158
	Sexy::Slider*			mMusicVolumeSlider;					//+0x15C
	Sexy::Slider*			mSfxVolumeSlider;					//+0x160
    LawnStoneButton*		mCheatButton;		                //+0x164
	LawnStoneButton*		mAlmanacButton;						//+0x168
	LawnStoneButton*		mBackToMainButton;					//+0x16C
	LawnStoneButton*		mRestartButton;						//+0x170
	NewLawnButton*			mBackToGameButton;					//+0x174
	bool					mFromGameSelector;					//+0x178

public:
	NewOptionsDialog(LawnApp* theApp, bool theFromGameSelector);
	~NewOptionsDialog();

	int						GetPreferredHeight(int theWidth);
	void					AddedToManager(Sexy::WidgetManager* theWidgetManager);
	void					RemovedFromManager(Sexy::WidgetManager* theWidgetManager);
	void					Resize(int theX, int theY, int theWidth, int theHeight);
	void					Draw(Sexy::Graphics* g);
	void					SliderVal(int theId, double theVal);
	void					ButtonPress(int theId);
	void					ButtonDepress(int theId);
	void					KeyDown(Sexy::KeyCode theKey);
};

#endif
